-- 新建一个学生表S，有包含如下信息
-- # 学号 id，
-- # 学生姓名 name，
-- # 性别 gender，
-- # 年龄 age，
-- # 专业 dept，
-- # 所在系编号 …等
-- # 并插入10条数据。
-- #
-- # 学号格式为 201801 201802 201803...
-- # 性别只有 'male' & 'female'
-- # 院系包含（信息系、数学系，计算机科学系 等）

-- 然后做如下查询：

-- 1.查询全体学生的学号与姓名。

-- 3.查询全体学生的详细记录。

-- 4.查询全体学生的姓名、出生年份和所属部门 使用列别名改变查询结果的列标题


-- 7.查询所有年龄在20岁以下的学生姓名及其年龄。


-- 8.查询年龄在20~23岁（包括20岁和23岁）之间的学生的姓名、系别和年龄。


-- 9.查询年龄不在20~23岁之间的学生姓名、系别和年龄。


-- 10.查询信息系、数学系和计算机系学生的姓名和性别。


-- 11.查询既不是信息系、数学系，也不是计算机科学系的学生的姓名和性别。


-- 12.查询学号为200518的学生的详细情况。


-- 13.查询所有姓刘学生的姓名、学号和性别。

-- 14.查询姓“李”且全名为两个汉字的学生的姓名。


-- 15.查询名字中第2个字为“立"字的学生的姓名和学号。


-- 16.查询所有不姓刘的学生姓名。


-- 17.查询学号在201801~201809之间的学生姓名。


-- 18.查询不同院系学生的人数。


-- 19.查询不同院系学生的平均年龄，并以降序排序。


-- 20.查询计算机系年龄在20岁以下的学生姓名。


-- 22.查询全体学生情况，查询结果按所在系的系号升序排列，同一系中的学生按年龄降序排列。